CSI API ETABS v1

# cDCoSP63133302011GetOverwrite Method

---

Retrieves the value of a concrete design overwrite item.

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetOverwrite(
    	string Name,
    	int Item,
    	ref double Value,
    	ref bool ProgDet
    )

    Function GetOverwrite (
    	Name As String,
    	Item As Integer,
    	ByRef Value As Double,
    	ByRef ProgDet As Boolean
    ) As Integer

    Dim instance As cDCoSP63133302011
    Dim Name As String
    Dim Item As Integer
    Dim Value As Double
    Dim ProgDet As Boolean
    Dim returnValue As Integer

    returnValue = instance.GetOverwrite(Name,
    	Item, Value, ProgDet)

    int GetOverwrite(
    	String^ Name,
    	int Item,
    	double% Value,
    	bool% ProgDet
    )

    abstract GetOverwrite :
            Name : string *
            Item : int *
            Value : float byref *
            ProgDet : bool byref -> int

#### Parameters

Name

    Type: SystemString
The name of a frame object with a concrete frame design procedure.

Item

    Type: SystemInt32
This is an integer between 1 and 22, inclusive, indicating the overwrite item
considered.

  1. Framing type (beams and columns)
  2. Live load reduction factor (beams and columns)
  3. Unbraced length ratio, Major (beams and columns)
  4. Unbraced length ratio, Minor (beams and columns)
  5. Effective length factor, K Major (columns only)
  6. Effective length factor, K Minor (columns only)
  7. Moment amplification factor, Eta Major (columns only)
  8. Moment amplification factor, Eta Minor (columns only)
  9. Gammab3 for column (columns only)
  10. Gammab3 for beam (beams only)
  11. Consider torsion (beams only)
  12. (qsw,1*Z1)/(Rs*As,1) (beams only)
  13. Corner rebar fraction top (beams only)
  14. Corner rebar fraction bottom (beams only)
  15. Consider minimum eccentricity (columns only)
  16. Consider crack analysis (beams only)
  17. Crack width limit full load, a_crc,ult [mm] (beams only)
  18. Crack width limit long term, a_crc,l,ult [mm] (beams only)
  19. Longitudinal rebar size top (beams only)
  20. Longitudinal rebar size bottom (beams only)
  21. Ignore beneficial Pu for beam design (beams only)
  22. Is longitudinal rebar ribbed (beams only)

Value

    Type: SystemDouble
The value of the considered overwrite item.

  1. Framing type
     * 0 = Program Default
     * 1 = Sway
     * 2 = NonSway
  2. Live load reduction factor

Value >= 0; 0 means use program determined value

  3. Unbraced length ratio, Major

Value >= 0; 0 means use program determined value

  4. Unbraced length ratio, Minor

Value >= 0; 0 means use program determined value

  5. Effective length factor, K Major

Value >= 0; 0 means use program determined value

  6. Effective length factor, K Minor

Value >= 0; 0 means use program determined value

  7. Moment amplification factor, Eta Major

Value >= 0; 0 means use program determined value

  8. Moment amplification factor, Eta Minor

Value >= 0; 0 means use program determined value

  9. Gammab3 for column

Value >= 0; 0 means use program determined value

  10. Gammab3 for beam

Value >= 0; 0 means use program determined value

  11. Consider torsion
     * 0 = No
     * Any other value = Yes
  12. (qsw,1*Z1)/(Rs*As,1)

Value >= 0; 0 means use program determined value

  13. Corner rebar fraction top

Value >= 0; 0 means use program determined value

  14. Corner rebar fraction bottom

Value >= 0; 0 means use program determined value

  15. Consider minimum eccentricity
     * 0 = No
     * Any other value = Yes
  16. Consider crack analysis
     * 0 = No
     * Any other value = Yes
  17. Crack Width Limit Full Load, a_crc,ult [mm]

Value >= 0; 0 means use program determined value

  18. Crack Width Limit Long Term, a_crc,l,ult [mm]

Value >= 0; 0 means use program determined value

  19. Longitudinal Rebar Size Top

Value is the index in the list of the rebar defined in the Reinforcing Bar
Sizes form

  20. Longitudinal Rebar Size Bottom

Value is the index in the list of the rebar defined in the Reinforcing Bar
Sizes form

  21. Ignore Beneficial Pu for Beam Design
     * 0 = No
     * Any other value = Yes
  22. Is Longitudinal Rebar Ribbed
     * 0 = No
     * Any other value = Yes

ProgDet

    Type: SystemBoolean
If this item is True, the specified value is program determined.

#### Return Value

Type: Int32
Returns zero if the item is successfully retrieved; otherwise it returns a
nonzero value.

Remarks

Examples

VB

Copy

    Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Value As Double
       Dim ProgDet As Boolean

    'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")

    'start ETABS application
      ret = EtabsObject.ApplicationStart()

    'create SapModel object
       SapModel = EtabsObject.SapModel

    'initialize model
       ret = SapModel.InitializeNewModel()

    'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)

    'create new concrete frame section property
       ret = SapModel.PropFrame.SetRectangle("R1", "4000Psi", 20, 12)

    'set frame section property
       ret = SapModel.FrameObj.SetSection("8", "R1")

    'set concrete design code
       ret = SapModel.DesignConcrete.SetCode("SP 63.13330.2012")

    'run analysis
       System.IO.Directory.CreateDirectory("c:\CSI_API_temp")
       ret = SapModel.File.Save("C:\CSI_API_temp\example.edb")
       ret = SapModel.Analyze.RunAnalysis

    'start concrete design
       ret = SapModel.DesignConcrete.StartDesign()

    'get overwrite item
       ret = SapModel.DesignConcrete.SP63133302011.GetOverwrite("8", 1, Value, ProgDet)

    'close ETABS
       EtabsObject.ApplicationExit(False)

    'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing

    End Sub

See Also

#### Reference

cDCoSP63133302011 Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com